GopalSaraf/Practicals/PSDL/include/proc/pic16f17114.h
// Register: DAC2DATL
#define DAC2DATL DAC2DATL
extern volatile unsigned char           DAC2DATL            __at(0x891);
#ifndef _LIB_BUILD
asm("DAC2DATL equ 0891h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DAC2R                  :8;
    };
    struct {
        unsigned DAT                    :8;
    };
} DAC2DATLbits_t;
extern volatile DAC2DATLbits_t DAC2DATLbits __at(0x891);
// bitfield macros
#define _DAC2DATL_DAC2R_POSN                                0x0
#define _DAC2DATL_DAC2R_POSITION                            0x0
#define _DAC2DATL_DAC2R_SIZE                                0x8
#define _DAC2DATL_DAC2R_LENGTH                              0x8
#define _DAC2DATL_DAC2R_MASK                                0xFF
#define _DAC2DATL_DAT_POSN                                  0x0
#define _DAC2DATL_DAT_POSITION                              0x0
#define _DAC2DATL_DAT_SIZE                                  0x8
#define _DAC2DATL_DAT_LENGTH                                0x8
#define _DAC2DATL_DAT_MASK                                  0xFF

// Register: OPA1CON0
#define OPA1CON0 OPA1CON0
extern volatile unsigned char           OPA1CON0            __at(0x90C);
#ifndef _LIB_BUILD
asm("OPA1CON0 equ 090Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SOC                    :3;
        unsigned UG                     :1;
        unsigned                        :1;
        unsigned CPON                   :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned SOC0                   :1;
        unsigned SOC1                   :1;
        unsigned                        :1;
        unsigned UG0                    :1;
    };
    struct {
        unsigned OPA1SOC                :3;
        unsigned OPA1UG                 :1;
        unsigned                        :1;
        unsigned OPA1CPON               :1;
        unsigned                        :1;
        unsigned OPA1EN                 :1;
    };
    struct {
        unsigned OPA1SOC0               :1;
        unsigned OPA1SOC1               :1;
    };
} OPA1CON0bits_t;
extern volatile OPA1CON0bits_t OPA1CON0bits __at(0x90C);
// bitfield macros
#define _OPA1CON0_SOC_POSN                                  0x0
#define _OPA1CON0_SOC_POSITION                              0x0
#define _OPA1CON0_SOC_SIZE                                  0x3
#define _OPA1CON0_SOC_LENGTH                                0x3
#define _OPA1CON0_SOC_MASK                                  0x7
#define _OPA1CON0_UG_POSN                                   0x3
#define _OPA1CON0_UG_POSITION                               0x3
#define _OPA1CON0_UG_SIZE                                   0x1
#define _OPA1CON0_UG_LENGTH                                 0x1
#define _OPA1CON0_UG_MASK                                   0x8
#define _OPA1CON0_CPON_POSN                                 0x5
#define _OPA1CON0_CPON_POSITION                             0x5
#define _OPA1CON0_CPON_SIZE                                 0x1
#define _OPA1CON0_CPON_LENGTH                               0x1
#define _OPA1CON0_CPON_MASK                                 0x20
#define _OPA1CON0_EN_POSN                                   0x7
#define _OPA1CON0_EN_POSITION                               0x7
#define _OPA1CON0_EN_SIZE                                   0x1
#define _OPA1CON0_EN_LENGTH                                 0x1
#define _OPA1CON0_EN_MASK                                   0x80
#define _OPA1CON0_SOC0_POSN                                 0x0
#define _OPA1CON0_SOC0_POSITION                             0x0
#define _OPA1CON0_SOC0_SIZE                                 0x1
#define _OPA1CON0_SOC0_LENGTH                               0x1
#define _OPA1CON0_SOC0_MASK                                 0x1
#define _OPA1CON0_SOC1_POSN                                 0x1
#define _OPA1CON0_SOC1_POSITION                             0x1
#define _OPA1CON0_SOC1_SIZE                                 0x1
#define _OPA1CON0_SOC1_LENGTH                               0x1
#define _OPA1CON0_SOC1_MASK                                 0x2
#define _OPA1CON0_UG0_POSN                                  0x3
#define _OPA1CON0_UG0_POSITION                              0x3
#define _OPA1CON0_UG0_SIZE                                  0x1
#define _OPA1CON0_UG0_LENGTH                                0x1
#define _OPA1CON0_UG0_MASK                                  0x8
#define _OPA1CON0_OPA1SOC_POSN                              0x0
#define _OPA1CON0_OPA1SOC_POSITION                          0x0
#define _OPA1CON0_OPA1SOC_SIZE                              0x3
#define _OPA1CON0_OPA1SOC_LENGTH                            0x3
#define _OPA1CON0_OPA1SOC_MASK                              0x7
#define _OPA1CON0_OPA1UG_POSN                               0x3
#define _OPA1CON0_OPA1UG_POSITION                           0x3
#define _OPA1CON0_OPA1UG_SIZE                               0x1
#define _OPA1CON0_OPA1UG_LENGTH                             0x1
#define _OPA1CON0_OPA1UG_MASK                               0x8
#define _OPA1CON0_OPA1CPON_POSN                             0x5
#define _OPA1CON0_OPA1CPON_POSITION                         0x5
#define _OPA1CON0_OPA1CPON_SIZE                             0x1
#define _OPA1CON0_OPA1CPON_LENGTH                           0x1
#define _OPA1CON0_OPA1CPON_MASK                             0x20
#define _OPA1CON0_OPA1EN_POSN                               0x7
#define _OPA1CON0_OPA1EN_POSITION                           0x7
#define _OPA1CON0_OPA1EN_SIZE                               0x1
#define _OPA1CON0_OPA1EN_LENGTH                             0x1
#define _OPA1CON0_OPA1EN_MASK                               0x80
#define _OPA1CON0_OPA1SOC0_POSN                             0x0
#define _OPA1CON0_OPA1SOC0_POSITION                         0x0
#define _OPA1CON0_OPA1SOC0_SIZE                             0x1
#define _OPA1CON0_OPA1SOC0_LENGTH                           0x1
#define _OPA1CON0_OPA1SOC0_MASK                             0x1
#define _OPA1CON0_OPA1SOC1_POSN                             0x1
#define _OPA1CON0_OPA1SOC1_POSITION                         0x1
#define _OPA1CON0_OPA1SOC1_SIZE                             0x1
#define _OPA1CON0_OPA1SOC1_LENGTH                           0x1
#define _OPA1CON0_OPA1SOC1_MASK                             0x2

// Register: OPA1CON1
#define OPA1CON1 OPA1CON1
extern volatile unsigned char           OPA1CON1            __at(0x90D);
#ifndef _LIB_BUILD
asm("OPA1CON1 equ 090Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NSS                    :3;
        unsigned RESON                  :1;
        unsigned GSEL                   :3;
    };
    struct {
        unsigned NSS0                   :1;
        unsigned NSS1                   :1;
        unsigned NSS2                   :1;
        unsigned                        :1;
        unsigned GSEL0                  :1;
        unsigned GSEL1                  :1;
        unsigned GSEL2                  :1;
    };
    struct {
        unsigned OPA1NSS                :3;
        unsigned OPA1RESON              :1;
        unsigned OPA1GSEL               :3;
    };
    struct {
        unsigned OPA1NSS0               :1;
        unsigned OPA1NSS1               :1;
        unsigned OPA1NSS2               :1;
        unsigned                        :1;
        unsigned OPA1GSEL0              :1;
        unsigned OPA1GSEL1              :1;
        unsigned OPA1GSEL2              :1;
    };
} OPA1CON1bits_t;
extern volatile OPA1CON1bits_t OPA1CON1bits __at(0x90D);
// bitfield macros
#define _OPA1CON1_NSS_POSN                                  0x0
#define _OPA1CON1_NSS_POSITION                              0x0
#define _OPA1CON1_NSS_SIZE                                  0x3
#define _OPA1CON1_NSS_LENGTH                                0x3
#define _OPA1CON1_NSS_MASK                                  0x7
#define _OPA1CON1_RESON_POSN                                0x3
#define _OPA1CON1_RESON_POSITION                            0x3
#define _OPA1CON1_RESON_SIZE                                0x1
#define _OPA1CON1_RESON_LENGTH                              0x1
#define _OPA1CON1_RESON_MASK                                0x8
#define _OPA1CON1_GSEL_POSN                                 0x4
#define _OPA1CON1_GSEL_POSITION                             0x4
#define _OPA1CON1_GSEL_SIZE                                 0x3
#define _OPA1CON1_GSEL_LENGTH                               0x3
#define _OPA1CON1_GSEL_MASK                                 0x70
#define _OPA1CON1_NSS0_POSN                                 0x0
#define _OPA1CON1_NSS0_POSITION                             0x0
#define _OPA1CON1_NSS0_SIZE                                 0x1
#define _OPA1CON1_NSS0_LENGTH                               0x1
#define _OPA1CON1_NSS0_MASK                                 0x1
#define _OPA1CON1_NSS1_POSN                                 0x1
#define _OPA1CON1_NSS1_POSITION                             0x1
#define _OPA1CON1_NSS1_SIZE                                 0x1
#define _OPA1CON1_NSS1_LENGTH                               0x1
#define _OPA1CON1_NSS1_MASK                                 0x2
#define _OPA1CON1_NSS2_POSN                                 0x2
#define _OPA1CON1_NSS2_POSITION                             0x2
#define _OPA1CON1_NSS2_SIZE                                 0x1
#define _OPA1CON1_NSS2_LENGTH                               0x1
#define _OPA1CON1_NSS2_MASK                                 0x4
#define _OPA1CON1_GSEL0_POSN                                0x4
#define _OPA1CON1_GSEL0_POSITION                            0x4
#define _OPA1CON1_GSEL0_SIZE                                0x1
#define _OPA1CON1_GSEL0_LENGTH                              0x1
#define _OPA1CON1_GSEL0_MASK                                0x10
#define _OPA1CON1_GSEL1_POSN                                0x5
#define _OPA1CON1_GSEL1_POSITION                            0x5
#define _OPA1CON1_GSEL1_SIZE                                0x1
#define _OPA1CON1_GSEL1_LENGTH                              0x1
#define _OPA1CON1_GSEL1_MASK                                0x20
#define _OPA1CON1_GSEL2_POSN                                0x6
#define _OPA1CON1_GSEL2_POSITION                            0x6
#define _OPA1CON1_GSEL2_SIZE                                0x1
#define _OPA1CON1_GSEL2_LENGTH                              0x1
#define _OPA1CON1_GSEL2_MASK                                0x40
#define _OPA1CON1_OPA1NSS_POSN                              0x0
#define _OPA1CON1_OPA1NSS_POSITION                          0x0
#define _OPA1CON1_OPA1NSS_SIZE                              0x3
#define _OPA1CON1_OPA1NSS_LENGTH                            0x3
#define _OPA1CON1_OPA1NSS_MASK                              0x7
#define _OPA1CON1_OPA1RESON_POSN                            0x3
#define _OPA1CON1_OPA1RESON_POSITION                        0x3
#define _OPA1CON1_OPA1RESON_SIZE                            0x1
#define _OPA1CON1_OPA1RESON_LENGTH                          0x1
#define _OPA1CON1_OPA1RESON_MASK                            0x8
#define _OPA1CON1_OPA1GSEL_POSN                             0x4
#define _OPA1CON1_OPA1GSEL_POSITION                         0x4
#define _OPA1CON1_OPA1GSEL_SIZE                             0x3
#define _OPA1CON1_OPA1GSEL_LENGTH                           0x3
#define _OPA1CON1_OPA1GSEL_MASK                             0x70
#define _OPA1CON1_OPA1NSS0_POSN                             0x0
#define _OPA1CON1_OPA1NSS0_POSITION                         0x0
#define _OPA1CON1_OPA1NSS0_SIZE                             0x1
#define _OPA1CON1_OPA1NSS0_LENGTH                           0x1
#define _OPA1CON1_OPA1NSS0_MASK                             0x1
#define _OPA1CON1_OPA1NSS1_POSN                             0x1
#define _OPA1CON1_OPA1NSS1_POSITION                         0x1
#define _OPA1CON1_OPA1NSS1_SIZE                             0x1
#define _OPA1CON1_OPA1NSS1_LENGTH                           0x1
#define _OPA1CON1_OPA1NSS1_MASK                             0x2
#define _OPA1CON1_OPA1NSS2_POSN                             0x2
#define _OPA1CON1_OPA1NSS2_POSITION                         0x2
#define _OPA1CON1_OPA1NSS2_SIZE                             0x1
#define _OPA1CON1_OPA1NSS2_LENGTH                           0x1
#define _OPA1CON1_OPA1NSS2_MASK                             0x4
#define _OPA1CON1_OPA1GSEL0_POSN                            0x4
#define _OPA1CON1_OPA1GSEL0_POSITION                        0x4
#define _OPA1CON1_OPA1GSEL0_SIZE                            0x1
#define _OPA1CON1_OPA1GSEL0_LENGTH                          0x1
#define _OPA1CON1_OPA1GSEL0_MASK                            0x10
#define _OPA1CON1_OPA1GSEL1_POSN                            0x5
#define _OPA1CON1_OPA1GSEL1_POSITION                        0x5
#define _OPA1CON1_OPA1GSEL1_SIZE                            0x1
#define _OPA1CON1_OPA1GSEL1_LENGTH                          0x1
#define _OPA1CON1_OPA1GSEL1_MASK                            0x20
#define _OPA1CON1_OPA1GSEL2_POSN                            0x6
#define _OPA1CON1_OPA1GSEL2_POSITION                        0x6
#define _OPA1CON1_OPA1GSEL2_SIZE                            0x1
#define _OPA1CON1_OPA1GSEL2_LENGTH                          0x1
#define _OPA1CON1_OPA1GSEL2_MASK                            0x40

